Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.TransformModel
Transforms all surfaces in the model according to the document's active
ground plane, shared coordinates and true north.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalShadingSurfaces
The collection of analytical shading surfaces.
Returns:
Returns the analytical shading surfaces after model calculation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalOpenings
The collection of analytical openings.
Returns:
Returns the analytical openings after model calculation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSurfaces
The collection of analytical surfaces.
Returns:
Returns the analytical surfaces after model calculation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSpaces
The collection of analytical spaces.
Returns:
Returns the analytical spaces after model calculation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel(Autodesk.Revit.DB.Document)
Gets the EnergyAnalysisDetailModel in given document.
document:
The document that contains the physical model of the building.
Returns:
Returns the EnergyAnalysisDetailModel contained in the document, if it exists. If it does not exist, this returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions)
Creates a new energy analysis detailed model.
Remarks:
The generated energy model is always returned in world coordinates.
The method TransformModel() transforms all surfaces in the model according to
ground plane, shared coordinates and true north.
The EnergyModelType in argument EnergyAnalysisDetailModelOptions indicates
whether the generated energy model is based on rooms/spaces or building elements. The default value
is EnergyModelType.SpatialElement.
document:
The document that contains the physical model of the building.
options:
The options to control the calculation rules.
Returns:
The created model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An EnergyAnalysisDetailModel cannot be created if EnergyModelType.BuildingElement is input
and AnalysisMode.ConceptualMasses is set in EnergyDataSettings (these values are incompatible).
-or-
Throws if there are no valid spatial bounding elements,
or no valid spatial elements in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the energy analysis detail model.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Throws if user aborted the energy analysis detail model creation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.ExportCategory
Export elements of this category in energy analysis.
Remarks:
Export will be based on the space type associated with the product creating it.
Valid categories are Rooms or MEP Spaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.BuildingTypeId
The building type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.ExportMullions
Indicates if to specify the setting for exporting mullions.
Remarks:
When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical
shading surface is produced from a mullion based on its centerline, thickness and offset.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.SimplifyCurtainSystems
Indicates if to specify the setting for simplified curtain systems.
Remarks:
Curtain Walls and Curtain Systems are normally exported as several openings, panel by panel,
while for energy analysis all you need is one giant window. A curtain wall with 50 panels
gets exported as 50 openings, while 1 opening with the total opening area would be more appropriate.
When this setting is on, one "large" window/opening will be exported for a curtain wall/system
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.IncludeShadingSurfaces
Indicates if to set and get the setting for if shading surfaces should be included.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Tier
Level of computation for energy analysis model.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
Manage the analytical thermal model.
Remarks:
The Export to gbXML and the Heating and Cooling Loads features
produces an analytical thermal model from the physical model
of a building. The analytical thermal model is composed of
spaces, zones and planar surfaces that represent the actual
volumetric elements of the building.
If there are currently no EnergyAnalysisDetailModel elements in
the document, when the first one is generated it will be considered
the persistent energy model (and maybe removed and recreated by
actions the user takes in the UI). If there is already a persistent
EnergyAnalysisDetailModel element in the document, the API can
generate other independent energy models, but they will not be
affected by the actions the user takes in the UI.
The EnergyAnalysisDetailModel will remain in the document until
it is discarded (either by the actions of the user, or by a call
to Document.Delete() ).
Since:
2012